#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rancher-mylabs/gh-action-digitalocean/runs/run-k41jJLRjRmQeqArB

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
digitalocean_project.k3s_cluster: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_vpc.k3s_vpc: Refreshing state... [id=7a44a8ec-8bde-4d77-adef-0d390f22a9a0]
digitalocean_firewall.k3s_firewall: Refreshing state... [id=27e7a2d4-5453-45e9-ad2d-9abd7975315b]
random_password.k3s_token: Refreshing state... [id=none]
digitalocean_database_cluster.k3s: Refreshing state... [id=b2d94d06-762e-4894-9fb3-70c8f6cd97e5]
digitalocean_droplet.k3s_agent[0]: Refreshing state... [id=293673644]
digitalocean_droplet.k3s_server[1]: Refreshing state... [id=293673643]
digitalocean_droplet.k3s_agent[2]: Refreshing state... [id=293673647]
digitalocean_droplet.k3s_server[0]: Refreshing state... [id=293673648]
digitalocean_loadbalancer.k3s_lb: Refreshing state... [id=7fa2412a-2ac2-4fbd-a114-9b6606fe3cf7]
digitalocean_droplet.k3s_agent[1]: Refreshing state... [id=293673646]
digitalocean_database_user.dbuser: Refreshing state... [id=b2d94d06-762e-4894-9fb3-70c8f6cd97e5/user/k3s_user]
digitalocean_database_firewall.k3s: Refreshing state... [id=b2d94d06-762e-4894-9fb3-70c8f6cd97e5-20220403160504829900000001]
digitalocean_project_resources.k3s_external_db: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_server_nodes[1]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_lb: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_server_nodes[0]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_agent_nodes[2]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_agent_nodes[1]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]
digitalocean_project_resources.k3s_agent_nodes[0]: Refreshing state... [id=736cb2da-bdf6-468e-8e40-8518dbc6f3e2]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # digitalocean_firewall.k3s_firewall has changed
  ~ resource "digitalocean_firewall" "k3s_firewall" {
      + droplet_ids     = []
        id              = "27e7a2d4-5453-45e9-ad2d-9abd7975315b"
        name            = "k3s-firewall"
      ~ pending_changes = [
          - {
              - droplet_id = 293673643
              - removing   = false
              - status     = "waiting"
            },
          - {
              - droplet_id = 293673644
              - removing   = false
              - status     = "waiting"
            },
          - {
              - droplet_id = 293673646
              - removing   = false
              - status     = "waiting"
            },
          - {
              - droplet_id = 293673647
              - removing   = false
              - status     = "waiting"
            },
          - {
              - droplet_id = 293673648
              - removing   = false
              - status     = "waiting"
            },
        ]
      ~ status          = "waiting" -> "succeeded"
        tags            = [
            "master-node",
            "worker-node",
        ]
        # (1 unchanged attribute hidden)


        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.k3s_agent[0] must be replaced
-/+ resource "digitalocean_droplet" "k3s_agent" {
      ~ created_at           = "2022-04-03T15:58:59Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "293673644" -> (known after apply)
      ~ ipv4_address         = "178.128.88.175" -> (known after apply)
      ~ ipv4_address_private = "10.2.15.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "k3s-agent-1"
      ~ price_hourly         = 0.02976 -> (known after apply)
      ~ price_monthly        = 20 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      + ssh_keys             = [
          + "34:9f:7a:e5:cf:7d:d9:ae:6b:f4:a2:a8:b4:98:88:6d",
        ] # forces replacement
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "worker-node",
        ]
      ~ urn                  = "do:droplet:293673644" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_droplet.k3s_agent[1] must be replaced
-/+ resource "digitalocean_droplet" "k3s_agent" {
      ~ created_at           = "2022-04-03T15:58:59Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "293673646" -> (known after apply)
      ~ ipv4_address         = "178.128.106.86" -> (known after apply)
      ~ ipv4_address_private = "10.2.15.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "k3s-agent-2"
      ~ price_hourly         = 0.02976 -> (known after apply)
      ~ price_monthly        = 20 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      + ssh_keys             = [
          + "34:9f:7a:e5:cf:7d:d9:ae:6b:f4:a2:a8:b4:98:88:6d",
        ] # forces replacement
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "worker-node",
        ]
      ~ urn                  = "do:droplet:293673646" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_droplet.k3s_agent[2] must be replaced
-/+ resource "digitalocean_droplet" "k3s_agent" {
      ~ created_at           = "2022-04-03T15:58:59Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "293673647" -> (known after apply)
      ~ ipv4_address         = "178.128.102.224" -> (known after apply)
      ~ ipv4_address_private = "10.2.15.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "k3s-agent-3"
      ~ price_hourly         = 0.02976 -> (known after apply)
      ~ price_monthly        = 20 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      + ssh_keys             = [
          + "34:9f:7a:e5:cf:7d:d9:ae:6b:f4:a2:a8:b4:98:88:6d",
        ] # forces replacement
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "worker-node",
        ]
      ~ urn                  = "do:droplet:293673647" -> (known after apply)
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_droplet.k3s_server[0] must be replaced
-/+ resource "digitalocean_droplet" "k3s_server" {
      ~ created_at           = "2022-04-03T15:58:59Z" -> (known after apply)
      ~ disk                 = 50 -> (known after apply)
      ~ id                   = "293673648" -> (known after apply)
      ~ ipv4_address         = "178.128.105.40" -> (known after apply)
      ~ ipv4_address_private = "10.2.15.6" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 2048 -> (known after apply)
        name                 = "k3s-server-1"
      ~ price_hourly         = 0.01488 -> (known after apply)
      ~ price_monthly        = 10 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      + ssh_keys             = [
          + "34:9f:7a:e5:cf:7d:d9:ae:6b:f4:a2:a8:b4:98:88:6d",
        ] # forces replacement
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "master-node",
        ]
      ~ urn                  = "do:droplet:293673648" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_droplet.k3s_server[1] must be replaced
-/+ resource "digitalocean_droplet" "k3s_server" {
      ~ created_at           = "2022-04-03T15:58:59Z" -> (known after apply)
      ~ disk                 = 50 -> (known after apply)
      ~ id                   = "293673643" -> (known after apply)
      ~ ipv4_address         = "206.189.154.250" -> (known after apply)
      ~ ipv4_address_private = "10.2.15.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 2048 -> (known after apply)
        name                 = "k3s-server-2"
      ~ price_hourly         = 0.01488 -> (known after apply)
      ~ price_monthly        = 10 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      + ssh_keys             = [
          + "34:9f:7a:e5:cf:7d:d9:ae:6b:f4:a2:a8:b4:98:88:6d",
        ] # forces replacement
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "master-node",
        ]
      ~ urn                  = "do:droplet:293673643" -> (known after apply)
      ~ vcpus                = 1 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_project_resources.k3s_agent_nodes[0] will be updated in-place
  ~ resource "digitalocean_project_resources" "k3s_agent_nodes" {
        id        = "736cb2da-bdf6-468e-8e40-8518dbc6f3e2"
      ~ resources = [
          - "do:droplet:293673644",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # digitalocean_project_resources.k3s_agent_nodes[1] will be updated in-place
  ~ resource "digitalocean_project_resources" "k3s_agent_nodes" {
        id        = "736cb2da-bdf6-468e-8e40-8518dbc6f3e2"
      ~ resources = [
          - "do:droplet:293673646",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # digitalocean_project_resources.k3s_agent_nodes[2] will be updated in-place
  ~ resource "digitalocean_project_resources" "k3s_agent_nodes" {
        id        = "736cb2da-bdf6-468e-8e40-8518dbc6f3e2"
      ~ resources = [
          - "do:droplet:293673647",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # digitalocean_project_resources.k3s_server_nodes[0] will be updated in-place
  ~ resource "digitalocean_project_resources" "k3s_server_nodes" {
        id        = "736cb2da-bdf6-468e-8e40-8518dbc6f3e2"
      ~ resources = [
          - "do:droplet:293673648",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # digitalocean_project_resources.k3s_server_nodes[1] will be updated in-place
  ~ resource "digitalocean_project_resources" "k3s_server_nodes" {
        id        = "736cb2da-bdf6-468e-8e40-8518dbc6f3e2"
      ~ resources = [
          - "do:droplet:293673643",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 5 to change, 5 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "DIGITALOCEAN_TOKEN" but
│ a value was found in file "/terraform/terraform.tfvars". If you meant to
│ use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pusher: @ronnyardi, Action: `pull_request`*